<?php
/**
 * The template for displaying 404 pages (not found)
 *
 * @link https://codex.wordpress.org/Creating_an_Error_404_Page
 *
 * @package DancingDeadRecords
 */

wp_head(); 
?>

	<main id="primary" class="site-main">

		<section class="error-404 not-found">

			<div class="page-content">
			<div class="typewriter">
    <div class="line">                                #############################</div>
    <div class="line">                                #############################</div>
    <div class="line">                               ###############################</div>
    <div class="line">                               ###############################</div>
    <div class="line">                              #################################</div>
    <div class="line">                              #################################</div>
    <div class="line">                              #################################</div>
    <div class="line">                             ###################################</div>
    <div class="line">                             ###################################</div>
    <div class="line">                             ###################################</div>
    <div class="line">                             ###################################</div>
    <div class="line">                            #####################################</div>
    <div class="line">                            #####################################</div>
    <div class="line">                           #######################################</div>
    <div class="line">                           #######################################</div>
    <div class="line">                           #######################################</div>
    <div class="line">                           ########################################</div>
    <div class="line">                          #########################################</div>
    <div class="line">                          #########################################</div>
    <div class="line">                          #########################################</div>
    <div class="line">                         ###########################################</div>
    <div class="line">                         ###########################################</div>
    <div class="line">                        #############################################</div>
    <div class="line">                        #############################################</div>
    <div class="line">                        #############################################</div>
    <div class="line">                        ##############################################</div>
    <div class="line">                       ###############################################</div>
    <div class="line">                       ###############################################</div>
    <div class="line">                      ################################################</div>
    <div class="line">                      #################################################</div>
    <div class="line">                      #################################################</div>
    <div class="line">                     ###################################################</div>
    <div class="line">                     #######################  ##########################</div>
    <div class="line">                     ############## #######    #########################</div>
    <div class="line">                     ############    #####    ##########################</div>
    <div class="line">                    ############      ###    ##########     #############</div>
    <div class="line">                    ############    #####   #########     ###############</div>
    <div class="line">                   #############    #####   #######       ################</div>
    <div class="line">                   #############    #####    ####      ###################</div>
    <div class="line">                   ###############   ####    ####    ###         #########</div>
    <div class="line">                  #################   ####    ##    ####      #############</div>
    <div class="line">                  ###################               ###    ################</div>
    <div class="line">                  ###################                     #################</div>
    <div class="line">                  ############   ####                     #################</div>
    <div class="line">                 ############    ####                    ###################</div>
    <div class="line">                 ############    ####                   ####################</div>
    <div class="line">                ############     ####                    ####################</div>
    <div class="line">                ############                              ###################</div>
    <div class="line">                #############                             ###################</div>
    <div class="line">               ####################                       ####################</div>
    <div class="line">               ######################                    #####################</div>
    <div class="line">               #######################                   #####################</div>
    <div class="line">               #######################                  ######################</div>
    <div class="line">              ###########################              ########################</div>
    <div class="line">              ############################            #########################</div>
    <div class="line">             #############################            ##########################</div>
    <div class="line">             #############################           ###########################</div>
    <div class="line">             #############################            ##########################</div>
    <div class="line">            ############################ #            ###########################</div>
    <div class="line">            #############################             ###########################</div>
    <div class="line">            #############################             ###########################</div>
    <div class="line">            ##############################            ###########################</div>
    <div class="line">           ###############################             ###########################</div>
    <div class="line">           ###############################             ###########################</div>
    <div class="line">          ################################              ###########################</div>
    <div class="line">          ###############################               ###########################</div>
    <div class="line">         ################################               ###########################</div>
    <div class="line">         ######################## ## ###                ############################</div>
    <div class="line">         #########################                      ##### ######################</div>
    <div class="line">         #########################                        #  #######################</div>
    <div class="line">        #####################                                   ####################</div>
    <div class="line">        ###############*                                             ################</div>
</div>

				<h1 class="p404-title">404</h1>
				

<script>
    const lines = document.querySelectorAll('.line');
    const typingSpeed = 30; // Durée pour chaque ligne

    lines.forEach((line, index) => {
        setTimeout(() => {
            line.style.animation = `typing 0.5s forwards`;
            if (index === lines.length - 1) {
                const cursor = document.createElement('span');
                cursor.classList.add('cursor');
                line.appendChild(cursor);
            }
        }, typingSpeed * index);
    });
</script>
				<h4>Oops! That page can’t be found.</h4>
				<a class="white-button" href="<?php echo get_home_url(); ?>"><button>Back to Home</button></a>

			</div><!-- .page-content -->
		</section><!-- .error-404 -->

	</main><!-- #main -->

